[
  {
    "post_number": 1,
    "author": "Jack Kuveke",
    "date": "2 days ago",
    "content": "Bootstrapped Founders: *working 80 hours per week on product, marketing, GTM, strategy, and network*\nVC Backed Founders: *working 80 hours per week, posting fundraising tips on LinkedIn*\nP.S. Subscribe to mynewsletter for the funniest business and tech news: https://lnkd.in/ep-9p93q",
    "reactions": 1090,
    "comments": 83,
    "reposts": 12,
    "engagement_types": ["like", "funny", "celebrate"]
  },
  {
    "post_number": 2,
    "author": "Jack Kuveke",
    "date": "4 days ago",
    "content": "Using AI to write content for your business is dumber than pitching a tent next to an active volcano.\n\nNews flash, AI isn't good at writing.\n\nAnyone who thinks it is probably thinks \"Fifty Shades of Grey\" is scholarly literature.\n\nAI is LITERALLY designed to be average.\n\nBut in the world of marketing, average doesn't cut it.\n\nIn the past 5 years, I've gotten:\n- Billionaires to answer cold emails\n- Social media posts to get 10s of millions of views\n- Investors to give me millions of dollars\n\nI did this by writing good copy. By sounding different.\n\nThe fastest-growing startups in the world realize this. They don't rely on AI because they know content is more competitive than ever.\n\nListen, I won't stop you from posting slop into the void of social media.\n\nBut if you don't want to do that, I've helped dozens of companies get millions of views on LinkedIn by making unique content.\n\nIf you want help with the same, sign up here: https://lnkd.in/eQ7F99eE",
    "reactions": 851,
    "comments": 79,
    "reposts": 16,
    "engagement_types": ["like", "funny", "celebrate"]
  },
  {
    "post_number": 3,
    "author": "Jack Kuveke",
    "date": "5 days ago",
    "content": "Elizabeth Holmes is the greatest entrepreneur of the decade.\n- Got VCs to give her $10B for a biz every scientist said was a scam.\n- Was considered a genius for years, even though her company never made money.\n- Married the heir to a fortune AFTER she was a convicted felon.\n- Convinced her new husband to do the same run scam while sitting in a federal prison.\n\nShe's truly the embodiment of the American dream.\n\nSubscribe to my newsletter to laugh at more crazy world and business news: https://lnkd.in/ekGih-Hf",
    "reactions": 705,
    "comments": 115,
    "reposts": 14,
    "engagement_types": ["like", "funny", "insightful"]
  },
  {
    "post_number": 4,
    "author": "Jack Kuveke",
    "date": "1 week ago",
    "content": "If I see another 10 year old who wants to be a YC backed founder, I'm reporting their family to child protective services.\n\nP.S. Susbcribe to my newsletter for the funniest way to get your business & world news: https://lnkd.in/eG_2SHwg",
    "reactions": 459,
    "comments": 38,
    "reposts": 8,
    "engagement_types": ["like", "funny", "love"]
  },
  {
    "post_number": 5,
    "author": "Jack Kuveke",
    "date": "1 week ago",
    "content": "Venture Capitalist: \"I have a background in finance & operations\".\n\nTheir background:\n\np.s. subscribe to my newsletter for the funniest way to read about business & world news: https://lnkd.in/ekGih-Hf",
    "reactions": 340,
    "comments": 18,
    "reposts": 4,
    "engagement_types": ["like", "funny", "love"]
  },
  {
    "post_number": 6,
    "author": "Jack Kuveke",
    "date": "1 week ago",
    "content": "No one picks founders better than Forbes 30 under 30!\n\nP.S. Subscribe to my newsletter to laugh about business & world news: https://lnkd.in/ekGih-Hf",
    "reactions": 722,
    "comments": 134,
    "reposts": 12,
    "engagement_types": ["like", "funny", "celebrate"]
  },
  {
    "post_number": 7,
    "author": "Jack Kuveke",
    "date": "1 week ago",
    "content": "Last year I hired 3 convicted felons to work for my company.\n\nAt first, many of my existing employees were nervous.\n\nI couldn't blame them. These men had a history of violent crimes & one of them even has a tear-shaped tattoo.\n\nBut since hiring them, my team has never worked harder.\n\nWhy? Because fear is the greatest motivator.\n\nMy employees know that these 3 guys would do anything for me. I mean ANYTHING…\n\nThe best part is, I don't even give the felons tasks. Just having them sit around the office has increased productivity by 35%.\n\nThe workforce has changed in 2026. Ping pong tables & Friday pizza parties don't motivate people like they used to.\n\nIt's time to try new creative strategies to get your team to work harder.\n\nSubscribe to my newsletter for more unhinged business satire: https://lnkd.in/ekGih-Hf",
    "reactions": 401,
    "comments": 70,
    "reposts": 5,
    "engagement_types": ["like", "funny", "insightful"]
  },
  {
    "post_number": 8,
    "author": "Jack Kuveke",
    "date": "2 weeks ago",
    "content": "Excited to announce I've invested in Pelosi Capital.\n\nFor years, my friend Nancy was distracted by her part-time job in politics.\n\nBut after beating Warren Buffett's 10-year investment return by over 500% she's decided to make the jump to full-time investing.\n\nHer investment timing and knowledge of complex AI startups are so good that it almost seems like she has insider information.\n\nShe spent decades as a loyal civil servant, but even in retirement, she's found a way to give back to society by managing people's investments.\n\nHonored to be her first investor and can't wait to see what she does next.\n\nP.S. Subscribe to my newsletter for the funniest tech & news satire: https://lnkd.in/ekGih-Hf",
    "reactions": 466,
    "comments": 53,
    "reposts": 7,
    "engagement_types": ["like", "funny", "celebrate"]
  },
  {
    "post_number": 9,
    "author": "Jack Kuveke",
    "date": "2 weeks ago",
    "content": "Tech bros in 2023: \"With AI we can finally cure cancer\"\n\nTech bros in 2026: \"With AI, I no longer need to talk to my family\"\n\nThis might be the innovation we expected, but at least now I don't have to text my crazy aunt Carol about politics.\n\nP.S. Subscribe to my newsletter for the funniest tech & world news: https://lnkd.in/ekGih-Hf",
    "reactions": 1136,
    "comments": 125,
    "reposts": 22,
    "engagement_types": ["like", "funny", "celebrate"]
  },
  {
    "post_number": 10,
    "author": "Jack Kuveke",
    "date": "2 weeks ago",
    "content": "Yesterday, I found out that one of the founders I invested in was reading a self-help book.\n\nI immediately had him fired.\n\nIf you have to get advice from other people, you're not fit to be a leader.\n\nThe legendary founder Sam Bankman-Fried once said, \"I don't want to say no book is ever worth reading, but I don't want to say one is either.\"\n\nSam built a company worth $32B & didn't read a single book.\n\nNot only does reading waste time, but it signals that you don't know how to figure things out on your own.\n\nYou can get all the best information on how to scale a business by watching Shark Tank on 2x speed.\n\np.s. subscribe to my newsletter for the funniest business & world news: https://lnkd.in/ekGih-Hf",
    "reactions": 304,
    "comments": 108,
    "reposts": 5,
    "engagement_types": ["like", "funny", "celebrate"]
  },
  {
    "post_number": 17,
    "author": "Jack Kuveke",
    "date": "1 month ago",
    "content": "This basically sums up every 21-year-old who wants to work for Goldman Sachs:\n\nSubscribe to my newsletter for the funniest business & world news: https://lnkd.in/ekGih-Hf",
    "reactions": 643,
    "comments": 33,
    "reposts": 8,
    "engagement_types": ["like", "funny", "celebrate"]
  },
  {
    "post_number": 18,
    "author": "Jack Kuveke",
    "date": "1 month ago",
    "content": "LinkedIn can be confusing. Let me translate some common buzzwords people use on their profiles:\n\nThought leader - you have a 78 IQ & get all of your \"thoughts\" from podcasts.\n\nCreative problem solver - if you think your business has problems now, just wait until you hire someone who uses this phrase.\n\nSales ninja - you couldn't sell a box of Girl Scout cookies to a 400-pound dude.\n\nEvangelist - you have no concrete skills but want people to think you're an expert at something (if you're a crypto evangelist, you probably used to steal wallets at a bar).\n\nTo any of my followers who use these on their profile, I'm obviously not talking about you.\n\nI hope this helps.\n\nP.S. Subscribe to my newsletter for the funniest business & world news: https://lnkd.in/ekGih-Hf",
    "reactions": 231,
    "comments": 56,
    "reposts": 9,
    "engagement_types": ["like", "funny", "love"]
  },
  {
    "post_number": 19,
    "author": "Jack Kuveke",
    "date": "1 month ago",
    "content": "If your startup scams non-profits & delcares bankruptcy, at least steal over $100M.\nIt's 2026 people, $29M worth of fraud is rookie numbers.\n\nThat's only like 3 Minnesota daycares.\n\nP.S. Subcribe to my newsletter for the funniest business & world news: https://lnkd.in/ekGih-Hf",
    "reactions": 311,
    "comments": 51,
    "reposts": 3,
    "engagement_types": ["like", "funny", "love"]
  },
  {
    "post_number": 20,
    "author": "Jack Kuveke",
    "date": "1 month ago",
    "content": "Here are 5 lessons from the Venezuelan invasion that made me a better CEO:\n\n🎯Eliminate competition: Not everyone has access to a Delta Force Strike team, but everyone has access to predatory lawyers and private investigators. Drown your competition in questionable legal issues.\n\n🏃‍➡️ Strike fast: Timing is everything, but don't wait to strike. Being the first to market with a product is a major advantage. Don't let your competition get ahead of you.\n\n⁉️ Disregard ethics: If you have to ask your lawyers if you can do something, you're already losing. Do you think Microsoft cared about antitrust laws when they became #1? No, their profits paid for the legal defense.\n\n💀 Minimize casualties: Obviously, I'm only talking about your own employees; re-hiring and training is expensive. It's only natural that your competitors' employees will be homeless by the time you're done with them. (Don't feel bad, Blackrock would have made them broke anyway)\n\n💰Seize resources: Just like America seized Venezuela's oil, so China couldn't, Meta bought up all the Nvidia graphics cards so their competitors couldn't. Even if your company doesn't need something, your competitors might, and that means you're buying it.\n\nTo all my loyal fans, I hope this helps. To all my competitors, I'm coming for you.\nP.S. Subscribe to my newsletter for more unhinged satire: https://lnkd.in/ekGih-Hf",
    "reactions": 450,
    "comments": 97,
    "reposts": 13,
    "engagement_types": ["like", "funny", "insightful"]
  },
  {
    "post_number": 37,
    "author": "Jack Kuveke",
    "date": "2 months ago",
    "content": "The tech industry has so much to be thankful for in 2025 ❤️",
    "reactions": 298,
    "comments": 16,
    "reposts": 2,
    "engagement_types": ["like", "funny", "love"]
  },
  {
    "post_number": 38,
    "author": "Jack Kuveke",
    "date": "2 months ago",
    "content": "For years, I struggled to find love.\n\nI tried everything.\n- Working out\n- Exploring hobbies\n- Volunteering at a soup kitchen\n\nNothing worked.\n\nBut then I raised $80M for my unprofitable AI startup, and people finally started seeing the real me.\n\nP.S. Subscribe to my newsletter for the funniest business & world news: https://lnkd.in/ekGih-Hf",
    "reactions": 617,
    "comments": 67,
    "reposts": 10,
    "engagement_types": ["funny", "like", "love"]
  },
  {
    "post_number": 39,
    "author": "Jack Kuveke",
    "date": "2 months ago",
    "content": "He has no idea that dad lost all of his college savings on labubu futures.\n\nP.S. Subscribe to my newsletter for funniest tech & business news: https://lnkd.in/ekGih-Hf",
    "reactions": 193,
    "comments": 17,
    "reposts": 3,
    "engagement_types": ["like", "funny", "celebrate"]
  },
    {
      "post_number": 40,
      "author": "Jack Kuveke",
      "date": "2 months ago",
      "content": "An entrepreneur asked me why their LinkedIn posts weren't getting likes.\n\nI told them your posts are more cringe than dming Sydney Sweeney and asking her to go to prom with you.\n\nSee, most LinkedIn content is worse than swallowing a rusty bucket of nails.\n\nP.S. Subscribe to my newsletter for the funniest business & world news: https://lnkd.in/ekGih-Hf",
      "reactions": 0,
      "comments": 0,
      "reposts": 0,
      "engagement_types": ["like", "funny"]
    }
  ]
